eisup_2019_docmng_integration/src/Catalogs/абс_ОбособленныеПодразделения/абс_ОбособленныеПодразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ОбособленныеПодразделения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПодразделения</name>
    <type>
      <types>EnumRef.абс_ВидыПодразделений</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерПФР</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерФСС</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерФондЗанятости</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтдельныйСчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтдельныйБаланс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводитВыплатыФизЛицам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПроизводящееНачислениеИВыплатуЗППоФилиалу</name>
    <type>
      <types>CatalogRef.абс_ОбособленныеПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициент</name>
    <comment>(Регл)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерриториальныеУсловияПФР</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ТерриториальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициентРФ</name>
    <comment>(Регл)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КодИСУЗК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОтветственноеОПпоНалогуНаПрибыль</name>
    <type>
      <types>CatalogRef.абс_ОбособленныеПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйОрган</name>
    <type>
      <types>CatalogRef.НалоговыеОрганы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияПереименования</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СтароеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЮридическая</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтараяДатаЗакрытия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Enums/абс_ВидыПодразделений/абс_ВидыПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыПодразделений</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
  <enumValues>
    <name>ОбособленноеПодразделение</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/абс_ОбособленныеПодразделения/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// АБС ВСТАВКА 32115
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка на права на справочник в разрезе организаций
	мТекущийПользователь = глЗначениеПеременной("глТекущийПользователь"); 
	//АБС ВСТАВКА №31729 НАЧАЛО «5 марта 2015 г.», Пополитов
	мРолиПользователяПоОрганизации_КТТК = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь, ПараметрыСеанса.абс_НастройкиСистемы.ОрганизацияКТТК);	
	//НетРолиПоОрганизации_КТТК = мРолиПользователяПоОрганизации_КТТК.Найти(Справочники.РолиИсполнителей.РуководительБухгалтерскойГруппы) = Неопределено;
	НетРолиПоОрганизации_КТТК = мРолиПользователяПоОрганизации_КТТК.Найти(Справочники.РолиИсполнителей.ВедениеОбособленныхПодразделений) = Неопределено;
	ЭтоСуперПользователь = мРолиПользователяПоОрганизации_КТТК.Найти(Справочники.РолиИсполнителей.СуперПользователь) <> Неопределено;
	//\\АБС ВСТАВКА №31729 КОНЕЦ 	
	
	// Если меняем организацию в обособке проверим права по обоим организациям

	//АБС ВСТАВКА №31268 НАЧАЛО «16 февраля 2015 г.», Пополитов
	//Если ЗначениеЗаполнено(Ссылка) И Ссылка.ГоловнаяОрганизация <> ГоловнаяОрганизация Тогда
		//мРолиПользователяПоОрганизации = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь, Ссылка.ГоловнаяОрганизация);
		
	//+++ Григорьев Д.В. - #7758734 (28.04.2017)	
	//Если не ЭтоГруппа и ЗначениеЗаполнено(Ссылка) и ЗначениеЗаполнено(Ссылка.Организация) и Ссылка.Организация <> Организация Тогда	
	Если ЗначениеЗаполнено(Ссылка) и ЗначениеЗаполнено(Ссылка.Организация) и Ссылка.Организация <> Организация Тогда	
	//--- Григорьев Д.В. - #7758734 (28.04.2017)	
		мРолиПользователяПоОрганизации = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь, Ссылка.Организация);
		//\\АБС ВСТАВКА №31268 КОНЕЦ
   		
		//Если мРолиПользователяПоОрганизации.Найти(Справочники.РолиИсполнителей.РуководительБухгалтерскойГруппы) = Неопределено и НетРолиПоОрганизации_КТТК Тогда
		Если Не ЭтоСуперПользователь Тогда
			Если мРолиПользователяПоОрганизации.Найти(Справочники.РолиИсполнителей.ВедениеОбособленныхПодразделений) = Неопределено и НетРолиПоОрганизации_КТТК Тогда
				ttk_ОбщегоНазначения.СообщитьОбОшибке("Недостаточно прав для записи/удаления обособленного подразделения организации " + Ссылка.Организация + "!", Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//АБС ВСТАВКА №31268 НАЧАЛО «16 февраля 2015 г.», Пополитов
	//мРолиПользователяПоОрганизации = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь, ГоловнаяОрганизация);
	мРолиПользователяПоОрганизации = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь, Организация);
	//\\АБС ВСТАВКА №31268 КОНЕЦ   	
	
	//Если не ЭтоГруппа и мРолиПользователяПоОрганизации.Найти(Справочники.РолиИсполнителей.РуководительБухгалтерскойГруппы) = Неопределено и НетРолиПоОрганизации_КТТК Тогда
	
	//+++ Григорьев Д.В. - #7758734 (28.04.2017)
	//Если не ЭтоГруппа и мРолиПользователяПоОрганизации.Найти(Справочники.РолиИсполнителей.ВедениеОбособленныхПодразделений) = Неопределено и НетРолиПоОрганизации_КТТК Тогда
	Если Не ЭтоСуперПользователь Тогда
		Если мРолиПользователяПоОрганизации.Найти(Справочники.РолиИсполнителей.ВедениеОбособленныхПодразделений) = Неопределено и НетРолиПоОрганизации_КТТК Тогда
	//--- Григорьев Д.В. - #7758734 (28.04.2017)
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Недостаточно прав для записи/удаления обособленного подразделения организации " + Организация + "!", Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка на структуру справочника:
	// Уровень 1 - группы справочника по головным организациям, только один элемент на каждую организацию
	// Уровень 2 - группы справочника по филиалам выделенным на отдельный баланс, количество не ограничего, головная организация должна соответстовать родителю
	// Уровень 3 - элементы справочника организации/обособленные подразделения, количество не ограничено, головная организация должна соответствовать родителям
	
	Если НЕ ЭтоГруппа И Уровень() <> 2 Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Обособленные подразделения должны находиться на третьем уровне справочника обособленных подразделений!", Отказ);
	ИначеЕсли ЭтоГруппа и Уровень() = 2 Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Группы обособленных подразделений должны находиться на первом или втором уровне справочника обособленных подразделений!", Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка по головной организации в иерархии справочника
	Если НЕ ЭтоГруппа Тогда
		Если ГоловнаяОрганизация <> Родитель.ГоловнаяОрганизация ИЛИ ГоловнаяОрганизация <> Родитель.ГоловнаяОрганизация Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Головная организация обособленного подразделения не соответствует структуре обособленных подразделений!", Отказ);
		КонецЕсли;
	Иначе
		// Проверим головную организацию группы организаций
		Если ЗначениеЗаполнено(Родитель) ТОгда
			Если ГоловнаяОрганизация <> Родитель.ГоловнаяОрганизация Тогда
				ttk_ОбщегоНазначения.СообщитьОбОшибке("Головная организация группы обособленных подразделений не соответствует структуре обособленных подразделений!", Отказ);
			КонецЕсли;			
		Иначе
			ЗапросГруппаОП = Новый Запрос(
			"ВЫБРАТЬ
			|	абс_ОбособленныеПодразделения.Ссылка
			|ИЗ
			|	Справочник.абс_ОбособленныеПодразделения КАК абс_ОбособленныеПодразделения
			|ГДЕ
			|	абс_ОбособленныеПодразделения.ГоловнаяОрганизация = &ГоловнаяОрганизация
			|	И абс_ОбособленныеПодразделения.Родитель = ЗНАЧЕНИЕ(справочник.абс_ОбособленныеПодразделения.ПустаяСсылка)
			|	И (НЕ абс_ОбособленныеПодразделения.Ссылка = &Ссылка)");
			
			ЗапросГруппаОП.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация);
			ЗапросГруппаОП.УстановитьПараметр("Ссылка", Ссылка);
			
			Выборка = ЗапросГруппаОП.Выполнить().Выбрать();
			
			Если Выборка.Количество() > 0 Тогда
				Выборка.Следующий();
				
				ttk_ОбщегоНазначения.СообщитьОбОшибке("По головной организации """ + ГоловнаяОрганизация + """ уже есть группа обособленных подразделений: """ + Выборка.Ссылка + "!", Отказ);
			КонецЕсли;
		КонецЕсли;
		
		// в случае изменения головной организации в группе обособленных подразделений проверим подчиненные элементы
		Если ЗначениеЗаполнено(Ссылка) И ГоловнаяОрганизация <> Ссылка.ГоловнаяОрганизация Тогда
			ЗапросИерархияСправочника = Новый Запрос(
			"ВЫБРАТЬ
			|	абс_ОбособленныеПодразделения.Ссылка
			|ИЗ
			|	Справочник.абс_ОбособленныеПодразделения КАК абс_ОбособленныеПодразделения
			|ГДЕ
			|	абс_ОбособленныеПодразделения.Ссылка В ИЕРАРХИИ(&Ссылка)
			|	И абс_ОбособленныеПодразделения.ГоловнаяОрганизация <> &ГоловнаяОрганизация");
			
			ЗапросИерархияСправочника.УстановитьПараметр("Ссылка", Ссылка);
			ЗапросИерархияСправочника.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация);
			
			ВыборкаИерархияСправочника = ЗапросИерархияСправочника.Выполнить().Выбрать();
			
			ttk_ОбщегоНазначения.СообщитьОбОшибке("В справочнике существуют подчиненные подразделения с другой головной организацией, изменение головной организации невозможно!", Отказ);
			
		КонецЕсли;
	КонецЕсли;
	
	// Проверка заполнения реквизитов
	Если ВидПодразделения = Перечисления.абс_ВидыПодразделений.Филиал  
		 ИЛИ ВидПодразделения = Перечисления.абс_ВидыПодразделений.ОбособленноеПодразделение Тогда
		 
		Если Не ЗначениеЗаполнено(Адрес) Тогда
			Сообщить("Не заполнено поле ""Адрес""");
			Отказ = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КПП) Тогда
			Сообщить("Не заполнено поле ""КПП""");
			Отказ = Истина;
		КонецЕсли; 
		//АБС Чалавиев 25.03.2014 39992
		Если Не ЗначениеЗаполнено(КодПоОКТМО) Тогда
			Сообщить("Не заполнено поле ""ОКТМО""");
			Отказ = Истина;
		КонецЕсли;  
		
		//Если Не ЗначениеЗаполнено(ОКАТО) Тогда
		//	Сообщить("Не заполнено поле ""ОКАТО""");
		//	Отказ = Истина;
		//КонецЕсли;
		//АБС Чалавиев 25.03.2014 39992
		Если ВидПодразделения = Перечисления.абс_ВидыПодразделений.Филиал И (НЕ (ОтдельныйСчет И ОтдельныйБаланс И ПроизводитВыплатыФизЛицам)) И (НЕ ЗначениеЗаполнено(ПодразделениеПроизводящееНачислениеИВыплатуЗППоФилиалу)) Тогда
			Сообщить("Не заполнено поле ""Подразделение производящее начисление и выплату ЗП по филиалу");
			Отказ = Истина;
		КонецЕсли;

	ИначеЕсли ВидПодразделения = Перечисления.абс_ВидыПодразделений.ЮридическоеЛицо Тогда
		
		Адрес 						= Неопределено;
		КПП 						= Неопределено;
		ОКАТО 						= Неопределено;
		РайонныйКоэффициент 		= Неопределено;
		РайонныйКоэффициентРФ  		= Неопределено;
		ТерриториальныеУсловияПФР	= Неопределено;		
		
   	КонецЕсли;	
	// АБС ВСТАВКА 32115
	
	// АБС ИЗМЕНЕНО 32115
	Если Модифицированность()  
		и НЕ ЭтоГруппа
		и ЗначениеЗаполнено(Наименование)
		и ((НЕ Наименование = Ссылка.Наименование) ИЛИ (НЕ ДатаЗакрытия = Ссылка.ДатаЗакрытия))
		и НЕ Отказ Тогда
	                              			
		  Строка = ИсторияПереименования.Добавить();
		  
		  Строка.Дата 				= абс_СерверныеФункции.ПолучитьДатуСервера();
		  Строка.СтароеНаименование = Ссылка.Наименование;
		  Строка.Ответственный 		= ПараметрыСеанса.ТекущийПользователь;
		  Строка.СтараяДатаЗакрытия = Ссылка.ДатаЗакрытия;
	КонецЕсли;
	// АБС ИЗМЕНЕНО 32115
	
КонецПроцедуры
